Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/aesb.h
/*
 * Component description for AESB
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-10-10T14:22:36Z */
#ifndef _PIC32CXMTC_AESB_COMPONENT_H_
#define _PIC32CXMTC_AESB_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR AESB                                         */
/* ************************************************************************** */

/* -------- AESB_CR : (AESB Offset: 0x00) ( /W 32) Control Register -------- */
#define AESB_CR_START_Pos                     _UINT32_(0)                                          /* (AESB_CR) Start Processing Position */
#define AESB_CR_START_Msk                     (_UINT32_(0x1) << AESB_CR_START_Pos)                 /* (AESB_CR) Start Processing Mask */
#define AESB_CR_START(value)                  (AESB_CR_START_Msk & (_UINT32_(value) << AESB_CR_START_Pos)) /* Assigment of value for START in the AESB_CR register */
#define AESB_CR_SWRST_Pos                     _UINT32_(8)                                          /* (AESB_CR) Software Reset Position */
#define AESB_CR_SWRST_Msk                     (_UINT32_(0x1) << AESB_CR_SWRST_Pos)                 /* (AESB_CR) Software Reset Mask */
#define AESB_CR_SWRST(value)                  (AESB_CR_SWRST_Msk & (_UINT32_(value) << AESB_CR_SWRST_Pos)) /* Assigment of value for SWRST in the AESB_CR register */
#define AESB_CR_UNLOCK_Pos                    _UINT32_(24)                                         /* (AESB_CR) Unlock Processing Position */
#define AESB_CR_UNLOCK_Msk                    (_UINT32_(0x1) << AESB_CR_UNLOCK_Pos)                /* (AESB_CR) Unlock Processing Mask */
#define AESB_CR_UNLOCK(value)                 (AESB_CR_UNLOCK_Msk & (_UINT32_(value) << AESB_CR_UNLOCK_Pos)) /* Assigment of value for UNLOCK in the AESB_CR register */
#define AESB_CR_Msk                           _UINT32_(0x01000101)                                 /* (AESB_CR) Register Mask  */


/* -------- AESB_MR : (AESB Offset: 0x04) (R/W 32) Mode Register -------- */
#define AESB_MR_CIPHER_Pos                    _UINT32_(0)                                          /* (AESB_MR) Processing Mode Position */
#define AESB_MR_CIPHER_Msk                    (_UINT32_(0x1) << AESB_MR_CIPHER_Pos)                /* (AESB_MR) Processing Mode Mask */
#define AESB_MR_CIPHER(value)                 (AESB_MR_CIPHER_Msk & (_UINT32_(value) << AESB_MR_CIPHER_Pos)) /* Assigment of value for CIPHER in the AESB_MR register */
#define AESB_MR_AAHB_Pos                      _UINT32_(2)                                          /* (AESB_MR) Automatic Bridge Mode Position */
#define AESB_MR_AAHB_Msk                      (_UINT32_(0x1) << AESB_MR_AAHB_Pos)                  /* (AESB_MR) Automatic Bridge Mode Mask */
#define AESB_MR_AAHB(value)                   (AESB_MR_AAHB_Msk & (_UINT32_(value) << AESB_MR_AAHB_Pos)) /* Assigment of value for AAHB in the AESB_MR register */
#define AESB_MR_DUALBUFF_Pos                  _UINT32_(3)                                          /* (AESB_MR) Dual Input Buffer Position */
#define AESB_MR_DUALBUFF_Msk                  (_UINT32_(0x1) << AESB_MR_DUALBUFF_Pos)              /* (AESB_MR) Dual Input Buffer Mask */
#define AESB_MR_DUALBUFF(value)               (AESB_MR_DUALBUFF_Msk & (_UINT32_(value) << AESB_MR_DUALBUFF_Pos)) /* Assigment of value for DUALBUFF in the AESB_MR register */
#define   AESB_MR_DUALBUFF_INACTIVE_Val       _UINT32_(0x0)                                        /* (AESB_MR) AESB_IDATARx cannot be written during processing of previous block.  */
#define   AESB_MR_DUALBUFF_ACTIVE_Val         _UINT32_(0x1)                                        /* (AESB_MR) AESB_IDATARx can be written during processing of previous block when SMOD = 0x2. It speeds up the overall runtime of large files.  */
#define AESB_MR_DUALBUFF_INACTIVE             (AESB_MR_DUALBUFF_INACTIVE_Val << AESB_MR_DUALBUFF_Pos) /* (AESB_MR) AESB_IDATARx cannot be written during processing of previous block. Position  */
#define AESB_MR_DUALBUFF_ACTIVE               (AESB_MR_DUALBUFF_ACTIVE_Val << AESB_MR_DUALBUFF_Pos) /* (AESB_MR) AESB_IDATARx can be written during processing of previous block when SMOD = 0x2. It speeds up the overall runtime of large files. Position  */
#define AESB_MR_PROCDLY_Pos                   _UINT32_(4)                                          /* (AESB_MR) Processing Delay Position */
#define AESB_MR_PROCDLY_Msk                   (_UINT32_(0xF) << AESB_MR_PROCDLY_Pos)               /* (AESB_MR) Processing Delay Mask */
#define AESB_MR_PROCDLY(value)                (AESB_MR_PROCDLY_Msk & (_UINT32_(value) << AESB_MR_PROCDLY_Pos)) /* Assigment of value for PROCDLY in the AESB_MR register */
#define AESB_MR_SMOD_Pos                      _UINT32_(8)                                          /* (AESB_MR) Start Mode Position */
#define AESB_MR_SMOD_Msk                      (_UINT32_(0x3) << AESB_MR_SMOD_Pos)                  /* (AESB_MR) Start Mode Mask */
#define AESB_MR_SMOD(value)                   (AESB_MR_SMOD_Msk & (_UINT32_(value) << AESB_MR_SMOD_Pos)) /* Assigment of value for SMOD in the AESB_MR register */
#define   AESB_MR_SMOD_MANUAL_START_Val       _UINT32_(0x0)                                        /* (AESB_MR) Manual mode  */
#define   AESB_MR_SMOD_AUTO_START_Val         _UINT32_(0x1)                                        /* (AESB_MR) Auto mode  */
#define   AESB_MR_SMOD_IDATAR0_START_Val      _UINT32_(0x2)                                        /* (AESB_MR) AESB_IDATAR0 access only Auto mode  */
#define AESB_MR_SMOD_MANUAL_START             (AESB_MR_SMOD_MANUAL_START_Val << AESB_MR_SMOD_Pos)  /* (AESB_MR) Manual mode Position  */
#define AESB_MR_SMOD_AUTO_START               (AESB_MR_SMOD_AUTO_START_Val << AESB_MR_SMOD_Pos)    /* (AESB_MR) Auto mode Position  */
#define AESB_MR_SMOD_IDATAR0_START            (AESB_MR_SMOD_IDATAR0_START_Val << AESB_MR_SMOD_Pos) /* (AESB_MR) AESB_IDATAR0 access only Auto mode Position  */
#define AESB_MR_OPMOD_Pos                     _UINT32_(12)                                         /* (AESB_MR) Operating Mode Position */
#define AESB_MR_OPMOD_Msk                     (_UINT32_(0x7) << AESB_MR_OPMOD_Pos)                 /* (AESB_MR) Operating Mode Mask */
#define AESB_MR_OPMOD(value)                  (AESB_MR_OPMOD_Msk & (_UINT32_(value) << AESB_MR_OPMOD_Pos)) /* Assigment of value for OPMOD in the AESB_MR register */
#define   AESB_MR_OPMOD_ECB_Val               _UINT32_(0x0)                                        /* (AESB_MR) Electronic Code Book mode  */
#define   AESB_MR_OPMOD_CBC_Val               _UINT32_(0x1)                                        /* (AESB_MR) Cipher Block Chaining mode  */
#define   AESB_MR_OPMOD_CTR_Val               _UINT32_(0x4)                                        /* (AESB_MR) Counter mode (16-bit internal counter)  */
#define AESB_MR_OPMOD_ECB                     (AESB_MR_OPMOD_ECB_Val << AESB_MR_OPMOD_Pos)         /* (AESB_MR) Electronic Code Book mode Position  */
#define AESB_MR_OPMOD_CBC                     (AESB_MR_OPMOD_CBC_Val << AESB_MR_OPMOD_Pos)         /* (AESB_MR) Cipher Block Chaining mode Position  */
#define AESB_MR_OPMOD_CTR                     (AESB_MR_OPMOD_CTR_Val << AESB_MR_OPMOD_Pos)         /* (AESB_MR) Counter mode (16-bit internal counter) Position  */
#define AESB_MR_LOD_Pos                       _UINT32_(15)                                         /* (AESB_MR) Last Output Data Mode Position */
#define AESB_MR_LOD_Msk                       (_UINT32_(0x1) << AESB_MR_LOD_Pos)                   /* (AESB_MR) Last Output Data Mode Mask */
#define AESB_MR_LOD(value)                    (AESB_MR_LOD_Msk & (_UINT32_(value) << AESB_MR_LOD_Pos)) /* Assigment of value for LOD in the AESB_MR register */
#define AESB_MR_CKEY_Pos                      _UINT32_(20)                                         /* (AESB_MR) Key Position */
#define AESB_MR_CKEY_Msk                      (_UINT32_(0xF) << AESB_MR_CKEY_Pos)                  /* (AESB_MR) Key Mask */
#define AESB_MR_CKEY(value)                   (AESB_MR_CKEY_Msk & (_UINT32_(value) << AESB_MR_CKEY_Pos)) /* Assigment of value for CKEY in the AESB_MR register */
#define   AESB_MR_CKEY_PASSWD_Val             _UINT32_(0xE)                                        /* (AESB_MR) Must be written with 0xE the first time that AESB_MR is programmed. For subsequent programming of AESB_MR, any value can be written, including that of 0xE. Always reads as 0.  */
#define AESB_MR_CKEY_PASSWD                   (AESB_MR_CKEY_PASSWD_Val << AESB_MR_CKEY_Pos)        /* (AESB_MR) Must be written with 0xE the first time that AESB_MR is programmed. For subsequent programming of AESB_MR, any value can be written, including that of 0xE. Always reads as 0. Position  */
#define AESB_MR_TAMPCLR_Pos                   _UINT32_(31)                                         /* (AESB_MR) Tamper Clear Enable Position */
#define AESB_MR_TAMPCLR_Msk                   (_UINT32_(0x1) << AESB_MR_TAMPCLR_Pos)               /* (AESB_MR) Tamper Clear Enable Mask */
#define AESB_MR_TAMPCLR(value)                (AESB_MR_TAMPCLR_Msk & (_UINT32_(value) << AESB_MR_TAMPCLR_Pos)) /* Assigment of value for TAMPCLR in the AESB_MR register */
#define AESB_MR_Msk                           _UINT32_(0x80F0F3FD)                                 /* (AESB_MR) Register Mask  */


/* -------- AESB_IER : (AESB Offset: 0x10) ( /W 32) Interrupt Enable Register -------- */
#define AESB_IER_DATRDY_Pos                   _UINT32_(0)                                          /* (AESB_IER) Data Ready Interrupt Enable Position */
#define AESB_IER_DATRDY_Msk                   (_UINT32_(0x1) << AESB_IER_DATRDY_Pos)               /* (AESB_IER) Data Ready Interrupt Enable Mask */
#define AESB_IER_DATRDY(value)                (AESB_IER_DATRDY_Msk & (_UINT32_(value) << AESB_IER_DATRDY_Pos)) /* Assigment of value for DATRDY in the AESB_IER register */
#define AESB_IER_URAD_Pos                     _UINT32_(8)                                          /* (AESB_IER) Unspecified Register Access Detection Interrupt Enable Position */
#define AESB_IER_URAD_Msk                     (_UINT32_(0x1) << AESB_IER_URAD_Pos)                 /* (AESB_IER) Unspecified Register Access Detection Interrupt Enable Mask */
#define AESB_IER_URAD(value)                  (AESB_IER_URAD_Msk & (_UINT32_(value) << AESB_IER_URAD_Pos)) /* Assigment of value for URAD in the AESB_IER register */
#define AESB_IER_SECE_Pos                     _UINT32_(19)                                         /* (AESB_IER) Security and/or Safety Event Position */
#define AESB_IER_SECE_Msk                     (_UINT32_(0x1) << AESB_IER_SECE_Pos)                 /* (AESB_IER) Security and/or Safety Event Mask */
#define AESB_IER_SECE(value)                  (AESB_IER_SECE_Msk & (_UINT32_(value) << AESB_IER_SECE_Pos)) /* Assigment of value for SECE in the AESB_IER register */
#define AESB_IER_Msk                          _UINT32_(0x00080101)                                 /* (AESB_IER) Register Mask  */


