Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo_freertos/firmware/src/packs/PIC32CX2051MTC128_DFP/component/aesb.h
/* -------- AESB_WPSR : (AESB Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define AESB_WPSR_WPVS_Pos                    _UINT32_(0)                                          /* (AESB_WPSR) Write Protection Violation Status (cleared on read) Position */
#define AESB_WPSR_WPVS_Msk                    (_UINT32_(0x1) << AESB_WPSR_WPVS_Pos)                /* (AESB_WPSR) Write Protection Violation Status (cleared on read) Mask */
#define AESB_WPSR_WPVS(value)                 (AESB_WPSR_WPVS_Msk & (_UINT32_(value) << AESB_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the AESB_WPSR register */
#define AESB_WPSR_CGD_Pos                     _UINT32_(1)                                          /* (AESB_WPSR) Clock Glitch Detected (cleared on read) Position */
#define AESB_WPSR_CGD_Msk                     (_UINT32_(0x1) << AESB_WPSR_CGD_Pos)                 /* (AESB_WPSR) Clock Glitch Detected (cleared on read) Mask */
#define AESB_WPSR_CGD(value)                  (AESB_WPSR_CGD_Msk & (_UINT32_(value) << AESB_WPSR_CGD_Pos)) /* Assigment of value for CGD in the AESB_WPSR register */
#define AESB_WPSR_SEQE_Pos                    _UINT32_(2)                                          /* (AESB_WPSR) Internal Sequencer Error (cleared on read) Position */
#define AESB_WPSR_SEQE_Msk                    (_UINT32_(0x1) << AESB_WPSR_SEQE_Pos)                /* (AESB_WPSR) Internal Sequencer Error (cleared on read) Mask */
#define AESB_WPSR_SEQE(value)                 (AESB_WPSR_SEQE_Msk & (_UINT32_(value) << AESB_WPSR_SEQE_Pos)) /* Assigment of value for SEQE in the AESB_WPSR register */
#define AESB_WPSR_SWE_Pos                     _UINT32_(3)                                          /* (AESB_WPSR) Software Control Error (cleared on read) Position */
#define AESB_WPSR_SWE_Msk                     (_UINT32_(0x1) << AESB_WPSR_SWE_Pos)                 /* (AESB_WPSR) Software Control Error (cleared on read) Mask */
#define AESB_WPSR_SWE(value)                  (AESB_WPSR_SWE_Msk & (_UINT32_(value) << AESB_WPSR_SWE_Pos)) /* Assigment of value for SWE in the AESB_WPSR register */
#define AESB_WPSR_PKRPVS_Pos                  _UINT32_(4)                                          /* (AESB_WPSR) Private Key Internal Register Protection Violation Status (cleared on read) Position */
#define AESB_WPSR_PKRPVS_Msk                  (_UINT32_(0x1) << AESB_WPSR_PKRPVS_Pos)              /* (AESB_WPSR) Private Key Internal Register Protection Violation Status (cleared on read) Mask */
#define AESB_WPSR_PKRPVS(value)               (AESB_WPSR_PKRPVS_Msk & (_UINT32_(value) << AESB_WPSR_PKRPVS_Pos)) /* Assigment of value for PKRPVS in the AESB_WPSR register */
#define AESB_WPSR_WPVSRC_Pos                  _UINT32_(8)                                          /* (AESB_WPSR) Write Protection Violation Source Position */
#define AESB_WPSR_WPVSRC_Msk                  (_UINT32_(0xFF) << AESB_WPSR_WPVSRC_Pos)             /* (AESB_WPSR) Write Protection Violation Source Mask */
#define AESB_WPSR_WPVSRC(value)               (AESB_WPSR_WPVSRC_Msk & (_UINT32_(value) << AESB_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the AESB_WPSR register */
#define AESB_WPSR_SWETYP_Pos                  _UINT32_(24)                                         /* (AESB_WPSR) Software Error Type (cleared on read) Position */
#define AESB_WPSR_SWETYP_Msk                  (_UINT32_(0xF) << AESB_WPSR_SWETYP_Pos)              /* (AESB_WPSR) Software Error Type (cleared on read) Mask */
#define AESB_WPSR_SWETYP(value)               (AESB_WPSR_SWETYP_Msk & (_UINT32_(value) << AESB_WPSR_SWETYP_Pos)) /* Assigment of value for SWETYP in the AESB_WPSR register */
#define   AESB_WPSR_SWETYP_READ_WO_Val        _UINT32_(0x0)                                        /* (AESB_WPSR) A write-only register has been read (Warning).  */
#define   AESB_WPSR_SWETYP_WRITE_RO_Val       _UINT32_(0x1)                                        /* (AESB_WPSR) AESB is enabled and a write access has been performed on a read-only register (Warning).  */
#define   AESB_WPSR_SWETYP_UNDEF_RW_Val       _UINT32_(0x2)                                        /* (AESB_WPSR) Access to an undefined address (Warning).  */
#define   AESB_WPSR_SWETYP_CTRL_START_Val     _UINT32_(0x3)                                        /* (AESB_WPSR) Abnormal use of AESB_CR.START command when DMA access is configured.  */
#define   AESB_WPSR_SWETYP_WEIRD_ACTION_Val   _UINT32_(0x4)                                        /* (AESB_WPSR) A Private Key Bus access, key write, init value write, output data read or AESB_MR and AESB_EMR write has been performed while a process is in progress (abnormal).  */
#define   AESB_WPSR_SWETYP_INCOMPLETE_KEY_Val _UINT32_(0x5)                                        /* (AESB_WPSR) A tentative of start is required while the key is not fully loaded into the AESB_KEYWRx registers.  */
#define AESB_WPSR_SWETYP_READ_WO              (AESB_WPSR_SWETYP_READ_WO_Val << AESB_WPSR_SWETYP_Pos) /* (AESB_WPSR) A write-only register has been read (Warning). Position  */
#define AESB_WPSR_SWETYP_WRITE_RO             (AESB_WPSR_SWETYP_WRITE_RO_Val << AESB_WPSR_SWETYP_Pos) /* (AESB_WPSR) AESB is enabled and a write access has been performed on a read-only register (Warning). Position  */
#define AESB_WPSR_SWETYP_UNDEF_RW             (AESB_WPSR_SWETYP_UNDEF_RW_Val << AESB_WPSR_SWETYP_Pos) /* (AESB_WPSR) Access to an undefined address (Warning). Position  */
#define AESB_WPSR_SWETYP_CTRL_START           (AESB_WPSR_SWETYP_CTRL_START_Val << AESB_WPSR_SWETYP_Pos) /* (AESB_WPSR) Abnormal use of AESB_CR.START command when DMA access is configured. Position  */
#define AESB_WPSR_SWETYP_WEIRD_ACTION         (AESB_WPSR_SWETYP_WEIRD_ACTION_Val << AESB_WPSR_SWETYP_Pos) /* (AESB_WPSR) A Private Key Bus access, key write, init value write, output data read or AESB_MR and AESB_EMR write has been performed while a process is in progress (abnormal). Position  */
#define AESB_WPSR_SWETYP_INCOMPLETE_KEY       (AESB_WPSR_SWETYP_INCOMPLETE_KEY_Val << AESB_WPSR_SWETYP_Pos) /* (AESB_WPSR) A tentative of start is required while the key is not fully loaded into the AESB_KEYWRx registers. Position  */
#define AESB_WPSR_ECLASS_Pos                  _UINT32_(31)                                         /* (AESB_WPSR) Software Error Class (cleared on read) Position */
#define AESB_WPSR_ECLASS_Msk                  (_UINT32_(0x1) << AESB_WPSR_ECLASS_Pos)              /* (AESB_WPSR) Software Error Class (cleared on read) Mask */
#define AESB_WPSR_ECLASS(value)               (AESB_WPSR_ECLASS_Msk & (_UINT32_(value) << AESB_WPSR_ECLASS_Pos)) /* Assigment of value for ECLASS in the AESB_WPSR register */
#define   AESB_WPSR_ECLASS_WARNING_Val        _UINT32_(0x0)                                        /* (AESB_WPSR) An abnormal access that does not affect system functionality  */
#define   AESB_WPSR_ECLASS_ERROR_Val          _UINT32_(0x1)                                        /* (AESB_WPSR) An access is performed into key, input data, control registers while the AESB is performing an encryption/decryption or a start is request by software or DMA while the key is not fully configured.  */
#define AESB_WPSR_ECLASS_WARNING              (AESB_WPSR_ECLASS_WARNING_Val << AESB_WPSR_ECLASS_Pos) /* (AESB_WPSR) An abnormal access that does not affect system functionality Position  */
#define AESB_WPSR_ECLASS_ERROR                (AESB_WPSR_ECLASS_ERROR_Val << AESB_WPSR_ECLASS_Pos) /* (AESB_WPSR) An access is performed into key, input data, control registers while the AESB is performing an encryption/decryption or a start is request by software or DMA while the key is not fully configured. Position  */
#define AESB_WPSR_Msk                         _UINT32_(0x8F00FF1F)                                 /* (AESB_WPSR) Register Mask  */


/** \brief AESB register offsets definitions */
#define AESB_CR_REG_OFST               _UINT32_(0x00)      /* (AESB_CR) Control Register Offset */
#define AESB_MR_REG_OFST               _UINT32_(0x04)      /* (AESB_MR) Mode Register Offset */
#define AESB_IER_REG_OFST              _UINT32_(0x10)      /* (AESB_IER) Interrupt Enable Register Offset */
#define AESB_IDR_REG_OFST              _UINT32_(0x14)      /* (AESB_IDR) Interrupt Disable Register Offset */
#define AESB_IMR_REG_OFST              _UINT32_(0x18)      /* (AESB_IMR) Interrupt Mask Register Offset */
#define AESB_ISR_REG_OFST              _UINT32_(0x1C)      /* (AESB_ISR) Interrupt Status Register Offset */
#define AESB_KEYWR_REG_OFST            _UINT32_(0x20)      /* (AESB_KEYWR) Key Word Register Offset */
#define AESB_KEYWR0_REG_OFST           _UINT32_(0x20)      /* (AESB_KEYWR0) Key Word Register Offset */
#define AESB_KEYWR1_REG_OFST           _UINT32_(0x24)      /* (AESB_KEYWR1) Key Word Register Offset */
#define AESB_KEYWR2_REG_OFST           _UINT32_(0x28)      /* (AESB_KEYWR2) Key Word Register Offset */
#define AESB_KEYWR3_REG_OFST           _UINT32_(0x2C)      /* (AESB_KEYWR3) Key Word Register Offset */
#define AESB_IDATAR_REG_OFST           _UINT32_(0x40)      /* (AESB_IDATAR) Input Data Register Offset */
#define AESB_IDATAR0_REG_OFST          _UINT32_(0x40)      /* (AESB_IDATAR0) Input Data Register Offset */
#define AESB_IDATAR1_REG_OFST          _UINT32_(0x44)      /* (AESB_IDATAR1) Input Data Register Offset */
#define AESB_IDATAR2_REG_OFST          _UINT32_(0x48)      /* (AESB_IDATAR2) Input Data Register Offset */
#define AESB_IDATAR3_REG_OFST          _UINT32_(0x4C)      /* (AESB_IDATAR3) Input Data Register Offset */
#define AESB_ODATAR_REG_OFST           _UINT32_(0x50)      /* (AESB_ODATAR) Output Data Register Offset */
#define AESB_ODATAR0_REG_OFST          _UINT32_(0x50)      /* (AESB_ODATAR0) Output Data Register Offset */
#define AESB_ODATAR1_REG_OFST          _UINT32_(0x54)      /* (AESB_ODATAR1) Output Data Register Offset */
#define AESB_ODATAR2_REG_OFST          _UINT32_(0x58)      /* (AESB_ODATAR2) Output Data Register Offset */
#define AESB_ODATAR3_REG_OFST          _UINT32_(0x5C)      /* (AESB_ODATAR3) Output Data Register Offset */
#define AESB_IVR_REG_OFST              _UINT32_(0x60)      /* (AESB_IVR) Initialization Vector Register Offset */
#define AESB_IVR0_REG_OFST             _UINT32_(0x60)      /* (AESB_IVR0) Initialization Vector Register Offset */
#define AESB_IVR1_REG_OFST             _UINT32_(0x64)      /* (AESB_IVR1) Initialization Vector Register Offset */
#define AESB_IVR2_REG_OFST             _UINT32_(0x68)      /* (AESB_IVR2) Initialization Vector Register Offset */
#define AESB_IVR3_REG_OFST             _UINT32_(0x6C)      /* (AESB_IVR3) Initialization Vector Register Offset */
#define AESB_EMR_REG_OFST              _UINT32_(0xB0)      /* (AESB_EMR) Extended Mode Register Offset */
#define AESB_WPMR_REG_OFST             _UINT32_(0xE4)      /* (AESB_WPMR) Write Protection Mode Register Offset */
#define AESB_WPSR_REG_OFST             _UINT32_(0xE8)      /* (AESB_WPSR) Write Protection Status Register Offset */

